<?php

return [
    'labels' => [
        'singular' => 'Администратор',
        'plural' => 'Администраторы',
		'create' => 'Создать'
    ],
	'index' => [
		'title' => 'Список администраторов',
	],
    'trashed' => [
        'title' => 'Удаленные администраторы',
    ],
	'create' => [
		'title' => 'Новый администратор',
	],
    'store' => [
	    'success' => 'Администратор успешно создан!',
	    'error' => 'Не удалось создать администратора!'
    ],
    'show' => [
        'title' => 'Администратор',
    ],
	'edit' => [
		'title' => 'Редактировать администратора',
	],
	'update' => [
		'success' => 'Администратор успешно обновлён!',
		'error' => 'Не удалось обновить администратора!'
	],
	'trash' => [
        'title' => 'Переместить администратора в корзину',
		'success' => 'Администратор успешно перемещен в корзину!',
		'error' => 'Не удалось переместить администратора в корзину!'
	],
    'restore' => [
        'title' => 'Восстановить администратора',
        'success' => 'Администратор успешно восстановлен!',
        'error' => 'Не удалось восстановить администратора!'
    ],
    'destroy' => [
        'title' => 'Удалить администратора',
        'success' => 'Администратор успешно удалён!',
        'error' => 'Не удалось удалить администратора!'
    ],
	'fields' => [
		'email' => 'Эл. почта',
		'email_verified_at' => 'Подтвержден',
		'password' => 'Пароль',
		'name' => 'Имя',
		'phone' => 'Телефон',
		'avatar' => 'Фотография',
		'role' => [
			'name' => 'Роль',
		],
		'company' => [
			'name' => 'Компания',
		],
	],
    'placeholders' => [
		'role' => 'Выберите Роль',
		'company' => 'Выберите Компанию',
    ],
    'columns' => [
		'email' => 'Эл. почта',
		'email_verified_at' => 'Подтвержден',
		'password' => 'Пароль',
		'name' => 'Имя',
		'phone' => 'Телефон',
		'avatar' => 'Фотография',
		'role' => [
			'name' => 'Роль',
		],
		'company' => [
			'name' => 'Компания',
		],
        'created_at' => 'Создан',
        'updated_at' => 'Изменён',
        'deleted_at' => 'Удалён',
    ],
    'filters' => [
		'role' => [
			'name' => 'Роль',
		],
		'company' => [
			'name' => 'Компания',
		],
    ],
];