<?php

return [
    'labels' => [
        'singular' => 'Сборка',
        'plural' => 'Сборки',
		'create' => 'Создать'
    ],
	'index' => [
		'title' => 'Список сборок',
	],
    'trashed' => [
        'title' => 'Удаленные сборки',
    ],
	'create' => [
		'title' => 'Новая сборка',
	],
    'store' => [
	    'success' => 'Сборка успешно создана!',
	    'error' => 'Не удалось создать сборку!'
    ],
    'show' => [
        'title' => 'Сборка',
    ],
	'edit' => [
		'title' => 'Редактировать сборку',
	],
	'update' => [
		'success' => 'Сборка успешно обновлена!',
		'error' => 'Не удалось обновить сборку!'
	],
	'trash' => [
        'title' => 'Переместить сборку в корзину',
		'success' => 'Сборка успешно перемещена в корзину!',
		'error' => 'Не удалось переместить сборку в корзину!'
	],
    'restore' => [
        'title' => 'Восстановить сборку',
        'success' => 'Сборка успешно восстановлена!',
        'error' => 'Не удалось восстановить сборку!'
    ],
    'destroy' => [
        'title' => 'Удалить сборку',
        'success' => 'Сборка успешно удалена!',
        'error' => 'Не удалось удалить сборку!'
    ],
    'assembly_list' => [
        'title' => 'Список сборки'
    ],
	'fields' => [
		'number' => 'Номер сборки',
		'comment' => 'Комментарий',

	],
    'placeholders' => [

    ],
    'columns' => [
		'number' => 'Номер сборки',
		'comment' => 'Комментарий',

        'created_at' => 'Создана',
        'updated_at' => 'Изменена',
        'deleted_at' => 'Удалена',
    ],
    'filters' => [
        'number' => 'Номер сборки'
    ],
];