<?php

return [
    'labels' => [
        'singular' => 'Баннер',
        'plural' => 'Баннеры',
		'create' => 'Создать'
    ],
	'index' => [
		'title' => 'Баннеры',
	],
    'trashed' => [
        'title' => 'Удаленные баннеры',
    ],
	'create' => [
		'title' => 'Новый баннер',
	],
    'store' => [
	    'success' => 'Баннер успешно создан!',
	    'error' => 'Не удалось создать баннер!'
    ],
    'show' => [
        'title' => 'Баннер',
    ],
	'edit' => [
		'title' => 'Редактировать баннер',
	],
	'update' => [
		'success' => 'Баннер успешно обновлён!',
		'error' => 'Не удалось обновить баннер!'
	],
	'trash' => [
        'title' => 'Переместить баннер в корзину',
		'success' => 'Баннер успешно перемещен в корзину!',
		'error' => 'Не удалось переместить баннер в корзину!'
	],
    'restore' => [
        'title' => 'Восстановить баннер',
        'success' => 'Баннер успешно восстановлен!',
        'error' => 'Не удалось восстановить баннер!'
    ],
    'destroy' => [
        'title' => 'Удалить баннер',
        'success' => 'Баннер успешно удалён!',
        'error' => 'Не удалось удалить баннер!'
    ],
	'fields' => [
		'name' => 'Название',
		'image' => 'Изображение',
		'url' => 'Ссылка',
		'customerTypes' => [
			'name' => 'Тип клиента',
		],
	],
    'placeholders' => [
		'customerTypes' => 'Выберите %s',
    ],
    'columns' => [
		'name' => 'Название',
		'image' => 'Изображение',
		'url' => 'Ссылка',
		'customerTypes' => [
			'name' => 'Тип клиента',
		],
        'created_at' => 'Создан',
        'updated_at' => 'Изменён',
        'deleted_at' => 'Удалён',
    ],
    'filters' => [
		'customerTypes' => [
			'name' => 'Тип клиента',
		],
    ],
];
