<?php

return [
    'labels' => [
        'singular' => 'Бренд',
        'plural' => 'Бренды',
		'create' => 'Создать'
    ],
	'index' => [
		'title' => 'Список брендов',
	],
    'trashed' => [
        'title' => 'Удаленные бренды',
    ],
	'create' => [
		'title' => 'Новый бренд',
	],
    'store' => [
	    'success' => 'Бренд успешно создан!',
	    'error' => 'Не удалось создать бренд!'
    ],
    'show' => [
        'title' => 'Бренд',
    ],
	'edit' => [
		'title' => 'Редактировать бренд',
	],
	'update' => [
		'success' => 'Бренд успешно обновлён!',
		'error' => 'Не удалось обновить бренд!'
	],
	'trash' => [
        'title' => 'Переместить бренд в корзину',
		'success' => 'Бренд успешно перемещен в корзину!',
		'error' => 'Не удалось переместить бренд в корзину!'
	],
    'restore' => [
        'title' => 'Восстановить бренд',
        'success' => 'Бренд успешно восстановлен!',
        'error' => 'Не удалось восстановить бренд!'
    ],
    'destroy' => [
        'title' => 'Удалить бренд',
        'success' => 'Бренд успешно удалён!',
        'error' => 'Не удалось удалить бренд!'
    ],
	'fields' => [
		'name' => 'Название',
		'logo' => 'Логотип',

	],
    'placeholders' => [

    ],
    'columns' => [
		'name' => 'Название',
		'logo' => 'Логотип',

        'created_at' => 'Создан',
        'updated_at' => 'Изменён',
        'deleted_at' => 'Удалён',
    ],
    'filters' => [

    ],
];