<?php

return [
    'labels' => [
        'singular' => 'Отгрузка',
        'plural' => 'Отгрузки',
		'create' => 'Создать'
    ],
	'index' => [
		'title' => 'Список отгрузок',
	],
    'trashed' => [
        'title' => 'Удаленные отгрузки',
    ],
	'create' => [
		'title' => 'Новая отгрузка',
	],
    'store' => [
	    'success' => 'Отгрузка успешно создана!',
	    'error' => 'Не удалось создать отгрузку!'
    ],
    'show' => [
        'title' => 'Отгрузка',
    ],
	'edit' => [
		'title' => 'Редактировать отгрузку',
	],
	'update' => [
		'success' => 'Отгрузка успешно обновлена!',
		'error' => 'Не удалось обновить отгрузку!'
	],
	'trash' => [
        'title' => 'Переместить отгрузку в корзину',
		'success' => 'Отгрузка успешно перемещена в корзину!',
		'error' => 'Не удалось переместить отгрузку в корзину!'
	],
    'restore' => [
        'title' => 'Восстановить отгрузку',
        'success' => 'Отгрузка успешно восстановлена!',
        'error' => 'Не удалось восстановить отгрузку!'
    ],
    'destroy' => [
        'title' => 'Удалить отгрузку',
        'success' => 'Отгрузка успешно удалена!',
        'error' => 'Не удалось удалить отгрузку!'
    ],
	'fields' => [
		'number' => 'Номер отгурзки',
		'assembly_number' => 'Номер сборки',
		'invoice_number' => 'Номер счёта',
		'status' => 'Статус',
		'delivery_type' => 'Тип доставки',
		'packages_quantity' => 'Количество упаковок',
		'comment' => 'Комментарий',
		'packageType' => [
			'name' => 'Тип упаковки',
		],
		'customer' => [
			'name' => 'Клиент',
		],
		'user' => [
			'name' => 'Менеджер',
		],
	],
    'placeholders' => [
		'packageType' => 'Выберите Тип упаковки',
		'customer' => 'Выберите Клиента',
		'user' => 'Выберите Менеджера',
    ],
    'columns' => [
		'number' => 'Номер отгурзки',
		'assembly_number' => 'Номер сборки',
		'invoice_number' => 'Номер счёта',
		'status' => 'Статус',
		'delivery_type' => 'Тип доставки',
		'packages_quantity' => 'Количество упаковок',
		'comment' => 'Комментарий',
		'packageType' => [
			'name' => 'Тип упаковки',
		],
		'customer' => [
			'name' => 'Клиент',
		],
		'user' => [
			'name' => 'Менеджер',
		],
        'created_at' => 'Создана',
        'updated_at' => 'Изменена',
        'deleted_at' => 'Удалена',
    ],
    'filters' => [
		'packageType' => [
			'name' => 'Тип упаковки',
		],
		'customer' => [
			'name' => 'Клиент',
		],
		'user' => [
			'name' => 'Менеджер',
		],
    ],
];