<?php

return [
    'labels' => [
        'singular' => 'Предзаказ клиента',
        'plural' => 'Предзаказы клиента',
		'create' => 'Создать'
    ],
	'index' => [
		'title' => 'Предзаказы клиента',
	],
    'trashed' => [
        'title' => 'Удаленные предзаказы клиента',
    ],
	'create' => [
		'title' => 'Новый предзаказ клиента',
	],
    'store' => [
	    'success' => 'Предзаказ клиента успешно создан!',
	    'error' => 'Не удалось создать предзаказ клиента!'
    ],
    'show' => [
        'title' => 'Предзаказ клиента',
    ],
	'edit' => [
		'title' => 'Редактировать предзаказ клиента',
	],
	'update' => [
		'success' => 'Предзаказ клиента успешно обновлён!',
		'error' => 'Не удалось обновить предзаказ клиента!'
	],
	'trash' => [
        'title' => 'Переместить предзаказ клиента в корзину',
		'success' => 'Предзаказ клиента успешно перемещен в корзину!',
		'error' => 'Не удалось переместить предзаказ клиента в корзину!'
	],
    'restore' => [
        'title' => 'Восстановить предзаказ клиента',
        'success' => 'Предзаказ клиента успешно восстановлен!',
        'error' => 'Не удалось восстановить предзаказ клиента!'
    ],
    'destroy' => [
        'title' => 'Удалить предзаказ клиента',
        'success' => 'Предзаказ клиента успешно удалён!',
        'error' => 'Не удалось удалить предзаказ клиента!'
    ],
	'fields' => [
		'number' => 'Номер',
		'reference_number' => 'Номер в системе клиента',
		'comment' => 'Комментарий',
		'customerUser' => [
			'name' => 'Сотрудник клиента',
		],
		'customerOrder' => [
			'number' => 'Заказ',
		],
		'customer' => [
            'name' => 'Клиент'
		],
		'items' => [
            'name' => 'Позиции предзаказа'
		],
	],
    'placeholders' => [
		'customerUser' => 'Выберите Сотрудника клиента',
		'customerOrder' => 'Выберите Заказ',
		'customer' => 'Выберите Customer',
		'items' => 'Выберите Items',
    ],
    'columns' => [
		'number' => 'Номер',
		'reference_number' => 'Номер в системе клиента',
		'comment' => 'Комментарий',
		'customerUser' => [
			'name' => 'Сотрудник клиента',
		],
		'customerOrder' => [
			'number' => 'Заказ',
		],
		'customer' => [
		    'name' => 'Клиент'
		],
		'items' => [
            'name' => 'Позиции предзаказа'
		],
        'created_at' => 'Создан',
        'updated_at' => 'Изменён',
        'deleted_at' => 'Удалён',
    ],
    'filters' => [
		'customerUser' => [
			'name' => 'Сотрудник клиента',
		],
		'customerOrder' => [
			'number' => 'Заказ',
		],
		'customer' => [
            'name' => 'Клиент'
		],
		'items' => [
            'name' => 'Позиции предзаказа'
		],
    ],
];
