<?php

return [
    'labels' => [
        'singular' => 'Заказ',
        'plural' => 'Заказы',
        'create' => 'Создать'
    ],
    'index' => [
        'title' => 'Заказы',
    ],
    'trashed' => [
        'title' => 'Удаленные заказы',
    ],
    'create' => [
        'title' => 'Новый заказ',
    ],
    'store' => [
        'success' => 'Заказ успешно создан!',
        'error' => 'Не удалось создать заказ!'
    ],
    'show' => [
        'title' => 'Заказ',
    ],
    'edit' => [
        'title' => 'Редактировать заказ',
    ],
    'update' => [
        'success' => 'Заказ успешно обновлён!',
        'error' => 'Не удалось обновить заказ!'
    ],
    'trash' => [
        'title' => 'Переместить заказ в корзину',
        'success' => 'Заказ успешно перемещен в корзину!',
        'error' => 'Не удалось переместить заказ в корзину!'
    ],
    'restore' => [
        'title' => 'Восстановить заказ',
        'success' => 'Заказ успешно восстановлен!',
        'error' => 'Не удалось восстановить заказ!'
    ],
    'destroy' => [
        'title' => 'Удалить заказ',
        'success' => 'Заказ успешно удалён!',
        'error' => 'Не удалось удалить заказ!'
    ],
    'order_review' => [
        'title' => 'Подтверждение заказа',
    ],
    'send_email' => [
        'title' => 'Отправить клиенту',
    ],
    'fields' => [
        'number' => 'Номер',
        'batch_number' => 'Номер в системе клиента',
        'comment' => 'Комментарий',
        'fc_overdue' => 'Просрочен',
        'fc_comment' => 'Комментарий в календаре',
        'fc_future_comment' => 'Комментарий к заказу в календаре',
        'sent_at' => 'Отправлен клиенту',
        'customer' => [
            'name' => 'Клиент',
        ],
        'user' => [
            'name' => 'Менеджер',
        ],
    ],
    'placeholders' => [
        'customer' => 'Выберите Клиента',
        'user' => 'Выберите Менеджера',
    ],
    'columns' => [
        'number' => 'Номер',
        'batch_number' => 'Номер в системе клиента',
        'comment' => 'Комментарий',
        'fc_overdue' => 'Просрочен',
        'fc_comment' => 'Комментарий в календаре',
        'fc_future_comment' => 'Комментарий к заказу в календаре',
        'sent_at' => 'Отправлен клиенту',
        'paymentType' => [
            'name' => 'Тип оплаты',
        ],
        'packageType' => [
            'name' => 'Тип упаковки',
        ],
        'customer' => [
            'name' => 'Клиент',
            'order_interval' => 'Интервал заказов',
        ],
        'user' => [
            'name' => 'Менеджер',
        ],
        'created_at' => 'Создан',
        'updated_at' => 'Изменён',
        'deleted_at' => 'Удалён',
    ],
    'filters' => [
        'number' => 'Номер заказа',
        'customer' => [
            'name' => 'Клиент',
            'order_interval' => 'Интервал заказов',
        ],
        'user' => [
            'name' => 'Менеджер',
        ],
    ],
    'statuses' => [
        'open' => 'Новый',
        'assembly' => 'Сборка',
        'shipment' => 'Отправка',
        'invoice' => 'Счет',
        'reject' => 'Отменён',
    ],
    'buttons' => [
        'order_review' => 'Подтверждение заказа',
        'package_list' => 'Упаковочный лист',
        'waybill' => 'Накладная',
    ],
    'calendar' => [
        'title' => 'Календарь'
    ]
];
