<?php

return [
    'labels' => [
        'singular' => 'Тип упаковки',
        'plural' => 'Типы упаковки',
		'create' => 'Создать'
    ],
	'index' => [
		'title' => 'Список типов упаковки',
	],
    'trashed' => [
        'title' => 'Удаленные типы упаковки',
    ],
	'create' => [
		'title' => 'Новый тип упаковки',
	],
    'store' => [
	    'success' => 'Тип упаковки успешно создан!',
	    'error' => 'Не удалось создать тип упаковки!'
    ],
    'show' => [
        'title' => 'Тип упаковки',
    ],
	'edit' => [
		'title' => 'Редактировать тип упаковки',
	],
	'update' => [
		'success' => 'Тип упаковки успешно обновлён!',
		'error' => 'Не удалось обновить тип упаковки!'
	],
	'trash' => [
        'title' => 'Переместить тип упаковки в корзину',
		'success' => 'Тип упаковки успешно перемещен в корзину!',
		'error' => 'Не удалось переместить тип упаковки в корзину!'
	],
    'restore' => [
        'title' => 'Восстановить тип упаковки',
        'success' => 'Тип упаковки успешно восстановлен!',
        'error' => 'Не удалось восстановить тип упаковки!'
    ],
    'destroy' => [
        'title' => 'Удалить тип упаковки',
        'success' => 'Тип упаковки успешно удалён!',
        'error' => 'Не удалось удалить тип упаковки!'
    ],
	'fields' => [
		'name' => 'Название',
		'description' => 'Описание',

	],
    'placeholders' => [

    ],
    'columns' => [
		'name' => 'Название',
		'description' => 'Описание',

        'created_at' => 'Создан',
        'updated_at' => 'Изменён',
        'deleted_at' => 'Удалён',
    ],
    'filters' => [

    ],
];