<?php

return [
    'labels' => [
        'singular' => 'Тип оплаты',
        'plural' => 'Типы оплаты',
		'create' => 'Создать'
    ],
	'index' => [
		'title' => 'Типы оплаты',
	],
    'trashed' => [
        'title' => 'Удаленные типы оплаты',
    ],
	'create' => [
		'title' => 'Новый тип оплаты',
	],
    'store' => [
	    'success' => 'Тип оплаты успешно создан!',
	    'error' => 'Не удалось создать тип оплаты!'
    ],
    'show' => [
        'title' => 'Тип оплаты',
    ],
	'edit' => [
		'title' => 'Редактировать тип оплаты',
	],
	'update' => [
		'success' => 'Тип оплаты успешно обновлён!',
		'error' => 'Не удалось обновить тип оплаты!'
	],
	'trash' => [
        'title' => 'Переместить тип оплаты в корзину',
		'success' => 'Тип оплаты успешно перемещен в корзину!',
		'error' => 'Не удалось переместить тип оплаты в корзину!'
	],
    'restore' => [
        'title' => 'Восстановить тип оплаты',
        'success' => 'Тип оплаты успешно восстановлен!',
        'error' => 'Не удалось восстановить тип оплаты!'
    ],
    'destroy' => [
        'title' => 'Удалить тип оплаты',
        'success' => 'Тип оплаты успешно удалён!',
        'error' => 'Не удалось удалить тип оплаты!'
    ],
	'fields' => [
		'name' => 'Название',

	],
    'placeholders' => [

    ],
    'columns' => [
		'name' => 'Название',

        'created_at' => 'Создан',
        'updated_at' => 'Изменён',
        'deleted_at' => 'Удалён',
    ],
    'filters' => [

    ],
];
