<?php

return [
    'labels' => [
        'singular' => 'Градация цен',
        'plural' => 'Градации цен',
		'create' => 'Создать'
    ],
	'index' => [
		'title' => 'Список градаций цен',
	],
    'trashed' => [
        'title' => 'Удаленные градации цен',
    ],
	'create' => [
		'title' => 'Новая градация цен',
	],
    'store' => [
	    'success' => 'Градация цен успешно создана!',
	    'error' => 'Не удалось создать градацию цен!'
    ],
    'show' => [
        'title' => 'Градация цен',
    ],
	'edit' => [
		'title' => 'Редактировать градацию цен',
	],
	'update' => [
		'success' => 'Градация цен успешно обновлена!',
		'error' => 'Не удалось обновить градацию цен!'
	],
	'trash' => [
        'title' => 'Переместить градацию цен в корзину',
		'success' => 'Градация цен успешно перемещена в корзину!',
		'error' => 'Не удалось переместить градацию цен в корзину!'
	],
    'restore' => [
        'title' => 'Восстановить градацию цен',
        'success' => 'Градация цен успешно восстановлена!',
        'error' => 'Не удалось восстановить градацию цен!'
    ],
    'destroy' => [
        'title' => 'Удалить градацию цен',
        'success' => 'Градация цен успешно удалена!',
        'error' => 'Не удалось удалить градацию цен!'
    ],
	'fields' => [
		'breakpoint' => 'Лоты',
		'priceGroup' => [
			'name' => 'Ценовая категория',
		],
		'productGroups' => [
			'name' => 'Товарная категория',
			'price' => 'Цена',
		],
	],
    'placeholders' => [
		'priceGroup' => 'Выберите Ценовую категорию',
		'productGroups' => 'Выберите Товарную категорию',
    ],
    'columns' => [
		'breakpoint' => 'Лоты',
		'priceGroup' => [
			'name' => 'Ценовая категория',
		],
		'productGroups' => [
			'name' => 'Товарная категория',
			'price' => 'Цена',
		],
        'created_at' => 'Создана',
        'updated_at' => 'Изменена',
        'deleted_at' => 'Удалена',
    ],
    'filters' => [
		'priceGroup' => [
			'name' => 'Ценовая категория',
		],
		'productGroups' => [
			'name' => 'Товарная категория',
			'price' => 'Цена',
		],
    ],
];