<?php

return [
    'labels' => [
        'singular' => 'Тег',
        'plural' => 'Теги',
		'create' => 'Создать'
    ],
	'index' => [
		'title' => 'Список тегов',
	],
    'trashed' => [
        'title' => 'Удаленные теги',
    ],
	'create' => [
		'title' => 'Новый тег',
	],
    'store' => [
	    'success' => 'Тег успешно создан!',
	    'error' => 'Не удалось создать тег!'
    ],
    'show' => [
        'title' => 'Тег',
    ],
	'edit' => [
		'title' => 'Редактировать тег',
	],
	'update' => [
		'success' => 'Тег успешно обновлён!',
		'error' => 'Не удалось обновить тег!'
	],
	'trash' => [
        'title' => 'Переместить тег в корзину',
		'success' => 'Тег успешно перемещен в корзину!',
		'error' => 'Не удалось переместить тег в корзину!'
	],
    'restore' => [
        'title' => 'Восстановить тег',
        'success' => 'Тег успешно восстановлен!',
        'error' => 'Не удалось восстановить тег!'
    ],
    'destroy' => [
        'title' => 'Удалить тег',
        'success' => 'Тег успешно удалён!',
        'error' => 'Не удалось удалить тег!'
    ],
	'fields' => [
		'name' => 'Название',
		'icon' => 'Значок',
		'color' => 'Цвет',
		'products' => [
			'name' => 'Товары',
		],
	],
    'placeholders' => [
		'products' => 'Выберите Товары',
    ],
    'columns' => [
		'name' => 'Название',
		'icon' => 'Значок',
		'color' => 'Цвет',
		'products' => [
			'name' => 'Товары',
		],
        'created_at' => 'Создан',
        'updated_at' => 'Изменён',
        'deleted_at' => 'Удалён',
    ],
    'filters' => [
		'products' => [
			'name' => 'Товары',
		],
    ],
];