<?php

return [
    'labels' => [
        'singular' => 'Регион',
        'plural' => 'Регионы',
		'create' => 'Создать'
    ],
	'index' => [
		'title' => 'Список регион',
	],
    'trashed' => [
        'title' => 'Удаленные регионы',
    ],
	'create' => [
		'title' => 'Новый регион',
	],
    'store' => [
	    'success' => 'Регион успешно создан!',
	    'error' => 'Не удалось создать регион!'
    ],
    'show' => [
        'title' => 'Регион',
    ],
	'edit' => [
		'title' => 'Редактировать регион',
	],
	'update' => [
		'success' => 'Регион успешно обновлён!',
		'error' => 'Не удалось обновить регион!'
	],
	'trash' => [
        'title' => 'Переместить регион в корзину',
		'success' => 'Регион успешно перемещен в корзину!',
		'error' => 'Не удалось переместить регион в корзину!'
	],
    'restore' => [
        'title' => 'Восстановить регион',
        'success' => 'Регион успешно восстановлен!',
        'error' => 'Не удалось восстановить регион!'
    ],
    'destroy' => [
        'title' => 'Удалить регион',
        'success' => 'Регион успешно удалён!',
        'error' => 'Не удалось удалить регион!'
    ],
	'fields' => [
		'name' => 'Название',

	],
    'placeholders' => [

    ],
    'columns' => [
		'name' => 'Название',

        'created_at' => 'Создан',
        'updated_at' => 'Изменён',
        'deleted_at' => 'Удалён',
    ],
    'filters' => [

    ],
];