<?php

return [
    'labels' => [
        'singular' => 'Роль',
        'plural' => 'Роли',
		'create' => 'Создать'
    ],
	'index' => [
		'title' => 'Список ролей',
	],
    'trashed' => [
        'title' => 'Удаленные роли',
    ],
	'create' => [
		'title' => 'Новая роль',
	],
    'store' => [
	    'success' => 'Роль успешно создана!',
	    'error' => 'Не удалось создать роль!'
    ],
    'show' => [
        'title' => 'Роль',
    ],
	'edit' => [
		'title' => 'Редактировать роль',
	],
	'update' => [
		'success' => 'Роль успешно обновлена!',
		'error' => 'Не удалось обновить роль!'
	],
	'trash' => [
        'title' => 'Переместить роль в корзину',
		'success' => 'Роль успешно перемещена в корзину!',
		'error' => 'Не удалось переместить роль в корзину!'
	],
    'restore' => [
        'title' => 'Восстановить роль',
        'success' => 'Роль успешно восстановлена!',
        'error' => 'Не удалось восстановить роль!'
    ],
    'destroy' => [
        'title' => 'Удалить роль',
        'success' => 'Роль успешно удалена!',
        'error' => 'Не удалось удалить роль!'
    ],
	'fields' => [
		'name' => 'Название',
		'slug' => 'URL',

	],
    'placeholders' => [

    ],
    'columns' => [
		'name' => 'Название',
		'slug' => 'URL',

        'created_at' => 'Создана',
        'updated_at' => 'Изменена',
        'deleted_at' => 'Удалена',
    ],
    'filters' => [

    ],
];