<?php

return [
    'labels' => [
        'singular' => 'Настройка',
        'plural' => 'Настройки',
        'create' => 'Создать'
    ],
    'index' => [
        'title' => 'Настройки',
    ],
    'trashed' => [
        'title' => 'Удаленные настройки',
    ],
    'create' => [
        'title' => 'Новый настройка',
    ],
    'store' => [
        'success' => 'Настройка успешно создан!',
        'error' => 'Не удалось создать настройки!'
    ],
    'show' => [
        'title' => 'Настройка',
    ],
    'edit' => [
        'title' => 'Редактировать настройки',
    ],
    'update' => [
        'success' => 'Настройка успешно обновлён!',
        'error' => 'Не удалось обновить настройки!'
    ],
    'trash' => [
        'title' => 'Переместить настройки в корзину',
        'success' => 'Настройка успешно перемещен в корзину!',
        'error' => 'Не удалось переместить настройки в корзину!'
    ],
    'restore' => [
        'title' => 'Восстановить настройки',
        'success' => 'Настройка успешно восстановлен!',
        'error' => 'Не удалось восстановить настройки!'
    ],
    'destroy' => [
        'title' => 'Удалить настройки',
        'success' => 'Настройка успешно удалён!',
        'error' => 'Не удалось удалить настройки!'
    ],
    //    'customAction' => [
    //        'title' => 'Сделать настройки',
    //        'success' => 'Настройка сделан успешно!',
    //        'redirect' => 'Настройка сделан успешно!',
    //        'error' => 'Не удалось сделать настройки!',
    //    ],
    'fields' => [
		'name' => 'Название',
		'value' => 'Значение',
        'setting_value' => [
            'key' => 'Ключи',
            'value' => 'Значение',
            'additional' => 'Дополнительные данные',
            'labels' => [
                'plural' => 'Значения'
            ]
        ]

    ],
    'placeholders' => [

    ],
    'columns' => [
        'name' => 'Название',
        'value' => 'Значение',

        'created_at' => 'Создан',
        'updated_at' => 'Изменён',
        'deleted_at' => 'Удалён',
    ],
    'filters' => [

    ],
];
