<?php

return [
    'labels' => [
        'singular' => 'Товар на складе',
        'plural' => 'Товары на складе',
		'create' => 'Создать'
    ],
	'index' => [
		'title' => 'Список товаров на складе',
	],
    'trashed' => [
        'title' => 'Удаленные товары на складе',
    ],
	'create' => [
		'title' => 'Новое товар на складе',
	],
    'store' => [
	    'success' => 'Товар на складе успешно создано!',
	    'error' => 'Не удалось создать товар на складе!'
    ],
    'show' => [
        'title' => 'Товар на складе',
    ],
	'edit' => [
		'title' => 'Редактировать товар на складе',
	],
	'update' => [
		'success' => 'Товар на складе успешно обновлено!',
		'error' => 'Не удалось обновить товар на складе!'
	],
	'trash' => [
        'title' => 'Переместить товар на складе в корзину',
		'success' => 'Товар на складе успешно перемещено в корзину!',
		'error' => 'Не удалось переместить товар на складе в корзину!'
	],
    'restore' => [
        'title' => 'Восстановить товар на складе',
        'success' => 'Товар на складе успешно восстановлено!',
        'error' => 'Не удалось восстановить товар на складе!'
    ],
    'destroy' => [
        'title' => 'Удалить товар на складе',
        'success' => 'Товар на складе успешно удалено!',
        'error' => 'Не удалось удалить товар на складе!'
    ],
	'fields' => [
		'delivery_number' => 'L-номер',
		'expiration_date' => 'Срок годности',
		'stock' => [
			'name' => 'Склад',
		],
		'product' => [
			'name' => 'Товар',
		],
		'customerOrderItem' => [
			'name' => 'Позиция заказа',
		],
	],
    'placeholders' => [
		'stock' => 'Выберите Склад',
		'product' => 'Выберите Товар',
		'customerOrderItem' => 'Выберите Позицию заказа',
    ],
    'columns' => [
		'delivery_number' => 'L-номер',
		'expiration_date' => 'Срок годности',
		'stock' => [
			'name' => 'Склад',
		],
		'product' => [
			'name' => 'Товар',
		],
		'customerOrderItem' => [
			'name' => 'Позиция заказа',
		],
        'created_at' => 'Создано',
        'updated_at' => 'Изменено',
        'deleted_at' => 'Удалено',
    ],
    'filters' => [
		'stock' => [
			'name' => 'Склад',
		],
		'product' => [
			'name' => 'Товар',
		],
		'customerOrderItem' => [
			'name' => 'Позиция заказа',
		],
    ],
];