<?php

return [
    'labels' => [
        'singular' => 'Движение',
        'plural' => 'Движения',
        'create' => 'Создать'
    ],
    'index' => [
        'title' => 'Список движений товаров',
    ],
    'trashed' => [
        'title' => 'Удаленные движения товаров',
    ],
    'create' => [
        'title' => 'Новое движение товаров',
    ],
    'store' => [
        'success' => 'Движение товаров успешно создано!',
        'error' => 'Не удалось создать движение товаров!'
    ],
    'show' => [
        'title' => 'Движение товаров',
    ],
    'edit' => [
        'title' => 'Редактировать движение товаров',
    ],
    'update' => [
        'success' => 'Движение товаров успешно обновлено!',
        'error' => 'Не удалось обновить движение товаров!'
    ],
    'trash' => [
        'title' => 'Переместить движение товаров в корзину',
        'success' => 'Движение товаров успешно перемещено в корзину!',
        'error' => 'Не удалось переместить движение товаров в корзину!'
    ],
    'restore' => [
        'title' => 'Восстановить движение товаров',
        'success' => 'Движение товаров успешно восстановлено!',
        'error' => 'Не удалось восстановить движение товаров!'
    ],
    'destroy' => [
        'title' => 'Удалить движение товаров',
        'success' => 'Движение товаров успешно удалено!',
        'error' => 'Не удалось удалить движение товаров!'
    ],
    'fields' => [
        'product_name' => 'Товар',
        'products_quantity' => 'Количество',
        'delivery_number' => 'L-номер',
        'expiration_date' => 'Срок годности',
        'comment' => 'Комментарий',
        'movement_type' => [
            'name' => 'Тип движения'
        ],
        'stockMovement' => [
            'name' => 'Движение товаров',
        ],
        'product' => [
            'name' => 'Товар',
        ],
    ],
    'placeholders' => [
        'stockMovement' => 'Выберите Движение товаров',
        'product' => 'Выберите Товар',
    ],
    'columns' => [
        'product_name' => 'Товар',
        'products_quantity' => 'Количество',
        'delivery_number' => 'L-номер',
        'expiration_date' => 'Срок годности',
        'movement_type' => 'Тип движения',
        'comment' => 'Комментарий',
        'formatted_products_quantity' => 'Количество',
        'stockMovement' => [
            'name' => 'Движение товаров',
            'stock' => [
                'name' => 'Склад',
            ],
        ],
        'product' => [
            'name' => 'Товар',
        ],
        'created_at' => 'Создано',
        'updated_at' => 'Изменено',
        'deleted_at' => 'Удалено',
    ],
    'filters' => [
        'stockMovement' => [
            'name' => 'Движение товаров',
            'stock' => [
                'name' => 'Склад',
            ],
        ],
        'product' => [
            'name' => 'Товар',
        ],
        'created_at' => 'Создано',
        'comment' => 'Комментарий (ДД.ММ.ГГГГ)'
    ],
];
