<?php

return [
    'labels' => [
        'singular' => 'Склад',
        'plural' => 'Склады',
		'create' => 'Создать'
    ],
	'index' => [
		'title' => 'Склады',
	],
    'trashed' => [
        'title' => 'Удаленные склады',
    ],
	'create' => [
		'title' => 'Новый склад',
	],
    'store' => [
	    'success' => 'Склад успешно создан!',
	    'error' => 'Не удалось создать склад!'
    ],
    'show' => [
        'title' => 'Склад',
    ],
	'edit' => [
		'title' => 'Редактировать склад',
	],
	'update' => [
		'success' => 'Склад успешно обновлён!',
		'error' => 'Не удалось обновить склад!'
	],
	'trash' => [
        'title' => 'Переместить склад в корзину',
		'success' => 'Склад успешно перемещен в корзину!',
		'error' => 'Не удалось переместить склад в корзину!'
	],
    'restore' => [
        'title' => 'Восстановить склад',
        'success' => 'Склад успешно восстановлен!',
        'error' => 'Не удалось восстановить склад!'
    ],
    'destroy' => [
        'title' => 'Удалить склад',
        'success' => 'Склад успешно удалён!',
        'error' => 'Не удалось удалить склад!'
    ],
	'fields' => [
		'name' => 'Наименование',
		'postcode' => 'Индекс',
		'address' => 'Адрес',
		'region' => [
			'name' => 'Регион',
		],
	],
    'placeholders' => [
		'region' => 'Выберите Регион',
    ],
    'columns' => [
		'name' => 'Наименование',
		'postcode' => 'Индекс',
		'address' => 'Адрес',
		'region' => [
			'name' => 'Регион',
		],
        'created_at' => 'Создан',
        'updated_at' => 'Изменён',
        'deleted_at' => 'Удалён',
    ],
    'filters' => [
		'region' => [
			'name' => 'Регион',
		],
    ],
];
