<?php

return [
    'labels' => [
        'singular' => 'Пользователь',
        'plural' => 'Пользователи',
		'create' => 'Создать'
    ],
	'index' => [
		'title' => 'Пользователи',
	],
    'trashed' => [
        'title' => 'Удаленные пользователи',
    ],
	'create' => [
		'title' => 'Новый пользователь',
	],
    'store' => [
	    'success' => 'Пользователь успешно создан!',
	    'error' => 'Не удалось создать пользователя!'
    ],
    'show' => [
        'title' => 'Пользователь',
    ],
	'edit' => [
		'title' => 'Редактировать пользователя',
	],
	'update' => [
		'success' => 'Пользователь успешно обновлён!',
		'error' => 'Не удалось обновить пользователя!'
	],
	'trash' => [
        'title' => 'Переместить пользователя в корзину',
		'success' => 'Пользователь успешно перемещен в корзину!',
		'error' => 'Не удалось переместить пользователя в корзину!'
	],
    'restore' => [
        'title' => 'Восстановить пользователя',
        'success' => 'Пользователь успешно восстановлен!',
        'error' => 'Не удалось восстановить пользователя!'
    ],
    'destroy' => [
        'title' => 'Удалить пользователя',
        'success' => 'Пользователь успешно удалён!',
        'error' => 'Не удалось удалить пользователя!'
    ],
	'fields' => [
		'email' => 'Эл. почта',
		'email_verified_at' => 'Подтвержден',
		'password' => 'Пароль',
		'name' => 'Имя',
		'phone' => 'Телефон',
		'avatar' => 'Фотография',
		'role' => [
			'name' => 'Роль',
		],
		'company' => [
			'name' => 'Компания',
		],
	],
    'placeholders' => [
		'role' => 'Выберите Роль',
		'company' => 'Выберите Компанию',
    ],
    'columns' => [
		'email' => 'Эл. почта',
		'email_verified_at' => 'Подтвержден',
		'password' => 'Пароль',
		'name' => 'Имя',
		'phone' => 'Телефон',
		'avatar' => 'Фотография',
		'role' => [
			'name' => 'Роль',
		],
		'company' => [
			'name' => 'Компания',
		],
        'created_at' => 'Создан',
        'updated_at' => 'Изменён',
        'deleted_at' => 'Удалён',
    ],
    'filters' => [
		'role' => [
			'name' => 'Роль',
		],
		'company' => [
			'name' => 'Компания',
		],
    ],
];
